[{"creator": "Shivang", "title": "Wynk Playlist Alarm", "description": "Value for users: Why listen to boring (and irritating) alarm tone when you can listen to to your favourite songs (and surprise recommended songs) from Wynk. Wake up every morning listening to motivational, devotional, curated or your favourite songs.\\n\\nValue for Wynk: Alarm is a utility feature and is used daily. On getting traction we directly get uptake in actives and retention rate."}, {"creator": "Saurabh", "title": "Songs and their versions", "description": "A song may have many versions of it like remix, unplugged, live, etc. \\nWhat if there was a way to smartly identify these together?\\n\\nUse case: When a user plays a regular song, we can show other versions of this song that a user may be interested in."}, {"creator": "Saurabh", "title": "Video: OST & Background Music", "description": "Many Movie/TV Show viewers are often interested in the songs (or background scores) played in the video. \\nI am sure a lot of us would have searched for the Game of Thrones songs or Friends Songs in season 4 or One Tree Hill Soundtrack (few of the top searched TV show music). \\n\\nWhat if we can create such a feature in Airtel TV app wherein we can suggest the songs that are being used in the video, which can then be interlinked to the music app where users can go an play these songs? \\n\\nI would love it as a user. I am sure a lot of us will. :)\\n\\nFuture add ons: Directly (one-click) create a playlist from Airtel TV that users can access in their Wynk account."}, {"creator": "Hitesh Bhatia", "title": "Get that Merch", "description": "Often it happens, that we are watching a video and our favourite star dons a Shirt which looks super cool. But later on, when we try to look up that product online we end up spending good 10-15 minutes or more.\\n\\nWhat if we could just pause the video app and order the product just by a click of a button or the voice command (just by saying Get that Merch)."}, {"creator": "Raj", "title": "Karaoke Competition", "description": "Users sing along their favorite raps, and compare their scores on how close they were to the actual lyrics/rhythm/beat"}, {"creator": "Saurabh", "title": "Collaborative Playlists (Lets play together)", "description": "Use Case: We need a playlist type where multiple users can work on collaboratively. \\n\\nFlow: The creator (owner) creates a playlists and shares it with his/her friends for collaboration (a different flow than a normal share). Users can accept the request and become part of the playlist. \\nThese users can do the following (in priority order): \\n1. Add Songs\\n2. Remove Songs\\n3. Reorder Songs\\n4. Change Playlist Image\\n\\nGood to have (for #codeBinge) - Any edit by a user  pushes an update notification to all users in collaboration\\n\\nNote - only owner can delete playlist and add new users for collaboration"}, {"creator": "Mrigank Gandhi", "title": "Music Control through Shake Gesture", "description": "Go to the next song by shaking your phone to the right, shake twice to pause/play the song. Build more smart gestures to control the playback like putting the phone face down to reduce the volume and spin the phone to shuffle the queue"}, {"creator": "Mrigank Gandhi", "title": "Wynk Music on Android Auto", "description": "Connected cars are the norm now and the number of active users will only grow in the coming months.\\n\\nWe have postponed developing for Android Auto for quite a long time. With Wynk on Android Auto, we would be directly available for atleast 100k power users who want to listen to music on the go. \\n\\nTeam members will also get the opportunity to test it out on an Android auto enabled car."}, {"creator": "Saurabh", "title": "Song Kya Hai? (Music Nerds are the best Nerds :D)", "description": "Create a song guessing game where the app plays a clip of a song and multiple users who have joined that game try to guess the song. User guessing the song first (or first 2/3 or something like that) get points. \\n\\nTo keep relevant songs for the users, we can ask users to select songs language, decade or any other filters that are relevant. \\n\\nThe real challenge will be to identify a relevant part of the song which is neither a direct lyrics to suggest the song directly nor a part which has nothing (or may be just silence). \\n\\nAlso, user input option can be free text (which brings the challenge to map it to actual song) or an option based quiz which makes the game easier. Something to think upon.\\n\\nThis can also be clubbed with some sort of a trivia game that Raj has mentioned in another idea. \\n\\nA quiz for music nerds!\\n\\nAnother variant - Guess the singer from the voice. This can be even more interesting and here giving options wont really be a big problem. Challenge will be creating options which have similar kin of voices. This is where content experts help can be taken with some logic (if an automated way is timetaking)."}, {"creator": "Mrigank Gandhi", "title": "Add FM Radio channels to Wynk", "description": "Create a FM tuner service and add it to Wynk. \\nBecause why not?"}, {"creator": "Ridhima Kapoor", "title": "When fitness and music play along !", "description": "Why not join fitbit and wynk music app together to recommend the type of songs wrt beats, synergy, and tempo mapping it down to the pulse of the user and be a happier you!"}, {"creator": "Saurabh", "title": "Collaborative Queue (variation of collaborative playlists)", "description": "Because music lovers who party together, play music together :)\\n\\nUse Case - When multiple users are together (say in a party or during a hike or studying together) and listening to music and they all want to keep playing some songs that they like. Now, to cater to this, asking the phone of the person who is playing and altering his/her queue is cumbersome and may be that person is chatting to his girlfriend/her boyfriend and doesnt really want to share his/her phone, in which case that person has to search for the song, find the right version and add it to the queue. \\nOther option is to ask that person to pause the song and then play on another phone. \\nWhat if the phone was connected to speakers? Youll have to disconnect and connect again. \\nTOO MUCH PAIN!\\n\\nWhat if, that user can just make his/her queue accessible to other friends and they all can work on it together. Everyone is happy! No? :)"}, {"creator": "Pratiyush", "title": "Mood based playlist", "description": "We can create mood based playlist. The parameters can be:\\n\\n1. Analysis of lyrics (for keywords associated with different moods). With new android providing support for real time transcribing, that can be taken as an input to determine the mood of the song.\\n2. The type of instrument (or combination of instruments) playing in the background. For example: Saxophone is usually associated with romantic music.\\n3. Traditional Metadata (of course)\\n4. Analysis of music signal for highs and lows and their patterns can give an idea of the mood it is supposed to reflect (https://www.musical-u.com/learn/the-many-moods-of-musical-modes/)\\n5. Finally for traditional (classical music) in both Indian and western styles there are certain combinations that signal specific mood. (I know for a fact certain ragas are used by music directors in industry to project certain moods.)"}, {"creator": "Saurabh", "title": "RJ [on] Wynk (Campus Radio)", "description": "Use Case: As a user, I may want to play a RJ in my campus/friend circle. I can just keep playing songs in my player queue and this playback can be streamed by any other user with who I have shared a live stream URL. \\n\\nThe receiving user can listen to this as a live stream. \\n\\nToned down solution (for #codeBinge) - listeners queue keeps getting updated as per the change by RJ (can use the player queue used for Radio, where songs dont actually show up on the UI).\\n\\nFuture add-on: Live voice communication can be added (just like real RJ-ing)"}, {"creator": "Saurabh", "title": "Sync the Lyrics", "description": "Use Case: We have got lakhs of static lyrics mapped to songs. We want to be able to sync these with the songs and play them alongside the song (just like subtitles). \\n\\nNeed an automated way to convert a static lyrics into a synched lyrics (lrc format)"}, {"creator": "Saurabh", "title": "Wynkzam - Shazam for Wynk", "description": "Use Case - User records a song piece and Wynk identifies which song was this (the Shazam feature)\\n\\nNote for freshers - Theres the concept of fingerprinting which is already existing in Wynk. The same can be leveraged for this. \\n\\nP.S. - The feature will obviously be renamed if it goes live :D"}, {"creator": "Amandeep", "title": "Smart Bulb", "description": "Connectivity between smart bulb and content played in app. Bulb changes the colour based on the scene played on the movie or tune of song"}, {"creator": "Vivek", "title": "Music according to light intensity of the room", "description": "For e.g., if its evening play soft,sufi music"}, {"creator": "Vikas Bansal", "title": "Music assistant", "description": "It is often I need to use google to play some music, what if we give our own wynk music assistant to user where a user and ask to play or add a song in the queue, going further what if we can just ask it to play romantic song or a romantic playlist"}, {"creator": "Rohan", "title": "ML driven dynamic playlist art personalisation and creation", "description": "ML driven dynamic and personalised playlist and artist art creation \\n\\nMost of the music consumption on wink music app is presently driven by curation  of playlist created by our content team. \\nCuration usually involves collaborating with the design team to create playlist cover image to take the playlist live. Also the cover images generated don\\u2019t follow a consistent design language due to which sometimes the experience on the app can be a little jarring (play button is inside the image and on the APP also)\\nAlso since now we have multiple music apps, like Wynk tube, Wynk Music App, Wynk Web, Primetime and Xstream coming up) which have different UI and design, so it makes sense to have multiple playlist images for different app to complement their design and beautify the apps\\n\\nSo I propose to build an intelligent ML driven system which can \\n- Creates dynamic playlist Cover image from the songs present in the playlist\\n- Playlist cover images changes over time as the playlist is heard by more users and new songs are added and removed\\n- Create APP and Platform centric cover images for artist and playlist\\n- Follow a consistent design language when creating playlist/album art\\n- Personalise cover images per user e.g. If we know a user has manually set his display language to Punjabi we can personalised the images for him by showing him the text in images in Punjabi\\n\\nFuture work:\\n- Such a system would be very useful for create playlist cover for personalized mixes and algorithmically generated playlist which we plan to pick up in the future"}, {"creator": "Harshit Jain", "title": "Set any song as your ringtone", "description": "Along with Hellotunes, users would also like to set their favorite songs as ringtone. So there should be an option to set a complete song as ringtone or crop any song and then set it as a ringtone."}, {"creator": "Prabhat", "title": "Tallify - Vertical video editor bot", "description": "A bot to automate editing of vertical video.\\n\\nA vertical video is a video that is intended for viewing in portrait mode, producing an image that is taller than it is wide. Vertical video didnt make sense up until now for professional video makers, but success of potrait video apps like snapchat, periscope, tiktok and facetime, has indicated a good market. Vertical video creates an immersive experience for the viewer.\\n\\nPossible strategy to solve it: Using aws rekognize to recognize objects in a video and create bounding box and using them to cue to apply various filters. Python has many libraries for video edit."}, {"creator": "Saurabh", "title": "Smart Memory Manager for Wynk", "description": "Theres a problem today in the app that a user may keep downloading songs, but may never play a few (or may be many) of those. Such songs keep lying in the memory and eats up users device space. \\nWe should find a way where the app can itself (ofcourse, with users permission) keep deleting the songs that are irrelevant for the user. \\n\\nAlso, it should identify that the songs that could be downloaded, in order for a better user experience (e.g. songs that users listens to frequently can be automatically downloaded, so as to avoid possible network issues that a user may run into next time playback)."}, {"creator": "Raj", "title": "World Radio", "description": "Choose location, year, and genre, and ten songs of that era present themselves to you, maybe a even a trivia quiz, awarding winners with subscriptions, etc"}, {"creator": "Raj", "title": "DJ Console", "description": "A DJ console, where user drags and drops songs, mixes them, records them, shares them with friends, maybe even live stream them as concerts."}, {"creator": "Hitesh Bhatia", "title": "Regional Lyrics", "description": "As of now lyrics for Hindi Songs are also on English language (hinglish). Why not have regional lyrics for Indian Sings, Hindi language lyrics for hindi Songs and Punjabi for Punjabi and so on."}, {"creator": "Amandeep", "title": "Wired headphone acts as wireless headgone", "description": "The phone acts as bluetooth device for wired headphones"}, {"creator": "Vivek", "title": "Set Hello tune", "description": "Current way of setting up Hello Tunes is too boring. Why not show users the option to show users which of these songs in playlist is available as Hello Tune as well. We will be offering something new to the end users. Also, if we do this, we will be clubbing lot of services together which is one of the main ideas behind Wynk."}, {"creator": "shivang", "title": "Crossfade Mode", "description": "Theres a period of 5-10 sec on silence between one song ending and another starting. \\n\\nValue for users: With crossfade mode, users can enjoy continuous playback without the gap. This is specially useful with our continuously improving recommendations. \\n\\nValue for Wynk: improves engagement and songs per sub"}, {"creator": "Vivek", "title": "Add advertisement on Downloaded songs, Option to share downloaded songs with friend who own Wynk App.", "description": "Through the first idea, we earn money by including advertisements in downloaded songs. It could be a very small add of 5 seconds. 2nd Clubbed idea is sharing of downloaded song using bluetooth when the other person is also using Wynk music add so that the other person doesnt need internet to download songs shared by other person."}, {"creator": "Harshit Jain", "title": "Audio filter", "description": "Just like Image and video filters available on many apps, Wynk music can have Audio filters.\\nWith Audio filters, user can listen to songs in various voices like a kids voice, funny voices, etc. There should be options to change the tempo and pitch of any song. With this user can play a song in fast/slow mode."}, {"creator": "Shubhank", "title": "Wynk Music Command Line Interface (CLI)", "description": "Following are the benefits of having a command line interface for Wynk Music - \\n1. Faster way to play favourite songs/playlists/radio for people who love the terminal.\\n2. Easy method to test streams at Wynk\\n3. Provides a layer for building IOT apps, assistants to developers\\n4. Revenue can be earned through SSAI"}, {"creator": "Pankaj Rawat", "title": "create live tv channel bookmark to mobile home screen", "description": "As a shortcut to open live tv like zee , sony etc from mobile home screen (navigate to tv app)."}, {"creator": "Umesh Kumar", "title": "Composer", "description": "Many of you have gone through this website https://thispersondoesnotexist.com/ that work on machine learning and draw a face. Similar we can do with music. Composer will compose music based on liked music."}, {"creator": "Rajiv", "title": "Video Song from Movies", "description": "Using Open Source audio finger-printing APIs to determine time stamps for songs in Movies thus curating Video Songs out of movies."}, {"creator": "Charul Bansal", "title": "Different content at different time of the day / week", "description": "As a user I watch maybe news / devotional in the morning, TV shows / movies while travelling to office and some Live TV serial at exactly 8 in the evening. The content surfaced to me should be different basis the time of the day / week and whether the user is travelling etc."}]